<?php
    /**
     * Created by PhpStorm.
     * User: Cranky4
     * Date: 07.12.2015
     * Time: 12:31
     */

    namespace app\components;

    class Translit
    {

        public static function ruToEng($string)
        {
            $converter = array(
                'à' => 'a',
                'á' => 'b',
                'â' => 'v',
                'ã' => 'g',
                'ä' => 'd',
                'å' => 'e',
                '¸' => 'e',
                'æ' => 'zh',
                'ç' => 'z',
                'è' => 'i',
                'é' => 'y',
                'ê' => 'k',
                'ë' => 'l',
                'ì' => 'm',
                'í' => 'n',
                'î' => 'o',
                'ï' => 'p',
                'ğ' => 'r',
                'ñ' => 's',
                'ò' => 't',
                'ó' => 'u',
                'ô' => 'f',
                'õ' => 'h',
                'ö' => 'c',
                '÷' => 'ch',
                'ø' => 'sh',
                'ù' => 'sch',
                'ü' => '\'',
                'û' => 'y',
                'ú' => '\'',
                'ı' => 'e',
                'ş' => 'yu',
                'ÿ' => 'ya',
                'À' => 'A',
                'Á' => 'B',
                'Â' => 'V',
                'Ã' => 'G',
                'Ä' => 'D',
                'Å' => 'E',
                '¨' => 'E',
                'Æ' => 'Zh',
                'Ç' => 'Z',
                'È' => 'I',
                'É' => 'Y',
                'Ê' => 'K',
                'Ë' => 'L',
                'Ì' => 'M',
                'Í' => 'N',
                'Î' => 'O',
                'Ï' => 'P',
                'Ğ' => 'R',
                'Ñ' => 'S',
                'Ò' => 'T',
                'Ó' => 'U',
                'Ô' => 'F',
                'Õ' => 'H',
                'Ö' => 'C',
                '×' => 'Ch',
                'Ø' => 'Sh',
                'Ù' => 'Sch',
                'Ü' => '\'',
                'Û' => 'Y',
                'Ú' => '\'',
                'İ' => 'E',
                'Ş' => 'Yu',
                'ß' => 'Ya',
            );

            return strtr($string, $converter);
        }


    }